           05 AD-ACCTNO      PIC X(5).
           05 AD-ACCTNOL     PIC S9(4) COMP.
           05 AD-FNAME       PIC X(15).
           05 AD-FNAMEL      PIC S9(4) COMP.
           05 AD-SNAME       PIC X(15).
           05 AD-SNAMEL      PIC S9(4) COMP.
           05 AD-TITLE       PIC X(4).
           05 AD-TITLEL      PIC S9(4) COMP.
           05 AD-ADDR1       PIC X(20).
           05 AD-ADDR1L      PIC S9(4) COMP.
           05 AD-ADDR2       PIC X(20).
           05 AD-ADDR2L      PIC S9(4) COMP.
           05 AD-STAT        PIC X(1).
           05 AD-STATL       PIC S9(4) COMP.
           05 AD-CRLIMIT     PIC X(8).
           05 AD-CRLIMITL    PIC S9(4) COMP.
           05 AD-MESSAGE     PIC X(60).

       01 AD-LENGTH          PIC S9(4) COMP
           VALUE 156.